<center><h1><strong><font color="blue">Studi Kasus Data Wrangling</font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/covers/cover_ui-n-taudata.jpg "taudata Analytics")

# Referensi:

1. Rattenbury, Tye, et al. Principles of data wrangling: Practical techniques for data preparation. " O'Reilly Media, Inc.", 2017.

2. McKinney, Wes. Python for data analysis: Data wrangling with Pandas, NumPy, and IPython. " O'Reilly Media, Inc.", 2012.

In [ ]:
# Load Module
import warnings; warnings.simplefilter('ignore')
import pandas as pd, numpy as np

'Done'

<center><h1><strong><font color="blue"> Combining and Merging Datasets </font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/join-in-Pandas-dataframe.png "taudata Analytics")

Ada 3 macam:
* pandas.merge connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.
* pandas.concat concatenates or “stacks” together objects along an axis.
* The combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

<center><h1><strong><font color="blue"> Database-Style DataFrame Joins (Merge/Join) </font></strong></h1></center>

<img alt="" src="images/"/>

In [52]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
     'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [53]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

# many-to-one join

the data in df1 has multiple rows labeled a
and b, whereas df2 has only one row for each value in the key column. Calling merge
with these objects we obtain:

## Data Mana yang Hilang? Mengapa?

In [54]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

# Bagaimana jika nama kolom berbeda?

In [55]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [56]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
    'data2': range(3)})

df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [58]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')[['lkey', 'data1', 'data2']]

  lkey  data1  data2
0    b      0      1
1    b      1      1
2    b      6      1
3    a      2      0
4    a      4      0
5    a      5      0

# Inner join

You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersec‐
tion, or the common set found in both tables.

<img alt="" src="GitHub\eLearning\images/join-in-Pandas-dataframe.png"/>

# Outer Join

Other possible options are 'left', 'right', and 'outer'. The outer join takes the union of the keys, combining the
effect of applying both left and right joins:

In [63]:
pd.merge(df1, df2, how='right') # Perhatikan outputnya.

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   d    NaN      2

# Many-to-many merges 

* well-defined, though not necessarily intuitive, behavior
* Many-to-many joins form the Cartesian product of the rows.

In [64]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
     'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [65]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
    'data2': range(5)})

df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [66]:
pd.merge(df1, df2, on='key', how='right')

   key  data1  data2
0    a    2.0      0
1    a    4.0      0
2    b    0.0      1
3    b    1.0      1
4    b    5.0      1
5    a    2.0      2
6    a    4.0      2
7    b    0.0      3
8    b    1.0      3
9    b    5.0      3
10   d    NaN      4

Since there were three
'b' rows in the left DataFrame and two in the right one, there are six 'b' rows in the
result. The join method only affects the distinct key values appearing in the result:

In [ ]:
pd.merge(df1, df2, how='inner')

<center><h1><strong><font color="blue"> merge with multiple keys </font></strong></h1></center>

* When you’re joining columns-on-columns, the indexes on the
passed DataFrame objects are discarded.

In [67]:
df1 = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
    'key2': ['one', 'two', 'one'],
    'lval': [1, 2, 3]})
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [68]:
df2 = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
     'key2': ['one', 'one', 'one', 'two'],
     'rval': [4, 5, 6, 7]})
df2

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [70]:
pd.merge(df1, df2, on=['key1', 'key2'], how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

# overlapping column names

* While you can address the overlap manually (Rename nama kolom), merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects

In [71]:
pd.merge(df1, df2, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [73]:
pd.merge(df1, df2, on='key1', suffixes=('_mahasiswa', '_nilai'))

  key1 key2_mahasiswa  lval key2_nilai  rval
0  foo            one     1        one     4
1  foo            one     1        one     5
2  foo            two     2        one     4
3  foo            two     2        one     5
4  bar            one     3        one     6
5  bar            one     3        two     7

<center><h1><strong><font color="blue"> Merging on Index </font></strong></h1></center>

In [74]:
df1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [75]:
df2 = pd.DataFrame({'group_val': [35, 7]}, index=['a', 'b'])
df2

   group_val
a         35
b          7

In [76]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0         35
2   a      2         35
3   a      3         35
1   b      1          7
4   b      4          7

# Concatenating Along an Axis

In [77]:
# Concat di DataFrame
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [82]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
    columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [83]:
df2.describe()

          three      four
count  2.000000  2.000000
mean   6.000000  7.000000
std    1.414214  1.414214
min    5.000000  6.000000
25%    5.500000  6.500000
50%    6.000000  7.000000
75%    6.500000  7.500000
max    7.000000  8.000000

In [81]:
pd.concat([df1, df2], axis=1) # , keys=['level1', 'level2']
#Perhatikan indexnya

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

<center><h1><strong><font color="blue"> Data Aggregation and Group Operations </font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/Aggregrate-Groups-Pandas-dataframe.png "taudata Analytics")

* pandas provides a flexible groupby interface, enabling you to slice, dice, and summarize datasets in a natural way.
* Aggregation of time series data, a special use case of groupby, is referred to as resampling.

<center><h1><strong><font color="blue"> 1. GroupBy Mechanics </font></strong></h1></center>

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/Split-Apply-Combine-Pandas-dataframe.png "taudata Analytics")

* Hadley Wickham, an author of many popular packages for the R programming lan‐
guage, coined the term split-apply-combine for describing group operations.

In [84]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.786245  0.546909
1    a  two -0.284872 -2.260946
2    b  one -0.583273 -0.441346
3    b  two  0.916315 -0.780372
4    a  one -0.441153  0.665472

In [85]:
grouped = df.groupby(df['key1']).mean()
grouped

         data1     data2
key1
a    -0.504090 -0.349522
b     0.166521 -0.610859

In [86]:
grouped.mean()

data1   -0.168784
data2   -0.480190
dtype: float64

In [88]:
means = df.groupby([df['key1'], df['key2']]).mean()
means

              data1     data2
key1 key2
a    one  -0.613699  0.606190
     two  -0.284872 -2.260946
b    one  -0.583273 -0.441346
     two   0.916315 -0.780372

# Menghasilkan Hierarchical Index

In [90]:
means.unstack()

         data1               data2
key2       one       two       one       two
key1
a    -0.613699 -0.284872  0.606190 -2.260946
b    -0.583273  0.916315 -0.441346 -0.780372

In [ ]:
df

In [91]:
df.groupby('key1').mean()

# You may have noticed in the first case df.groupby('key1').mean() that there is no key2 column in the result. 
# Because df['key2'] is not numeric data, it is said to be a nuisance column, which is therefore excluded from the result.

         data1     data2
key1
a    -0.504090 -0.349522
b     0.166521 -0.610859

# GroupBy bisa flexible dengan memilih grouping berdasarkan kolom mana saja

* Sekalian rename hasil groupBy-nya

In [92]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -0.158255 -1.850618 -0.807334 -0.449706 -2.204678
Steve  -0.580706 -0.059473 -0.178171  0.518281 -1.460168
Wes    -0.513657 -1.330528  0.738925 -0.297000 -0.296131
Jim    -1.617540 -0.358117 -0.403694 -0.223148  1.966557
Travis -1.015081  0.153146 -1.711588 -0.191658  0.733373

In [93]:
d = {'a': 'MKDU', 'b': 'MKDU', 'c': 'MKW', 'd': 'MKW', 'e': 'MKDU', 'f' : 'orange'}
d

{'a': 'MKDU', 'b': 'MKDU', 'c': 'MKW', 'd': 'MKW', 'e': 'MKDU', 'f': 'orange'}

In [97]:
people.groupby(d, axis=1).max()

            MKDU       MKW
Joe    -0.158255 -0.449706
Steve  -0.059473  0.518281
Wes    -0.296131  0.738925
Jim     1.966557 -0.223148
Travis  0.733373 -0.191658

<center><h1><strong><font color="blue"> Data Aggregation </font></strong></h1></center>

<img alt="" src="GitHub\eLearning\images/GroupBy-Pandas-dataframe.png"/>

* Aggregations refer to any data transformation that produces scalar values from
arrays. 
* Tidak hanya fungsi yang ditabel diatas

In [ ]:
df

In [95]:
df.groupby('key1').quantile(0.9)

         data1     data2
key1
a    -0.316128  0.641759
b     0.766356 -0.475248

# Custom Aggregate Function 

### Perhatikan, ini sangat penting untuk diketahui

In [98]:
def RangeData(arr):
    return arr.max() - arr.min()

In [99]:
df.groupby('key1').agg(RangeData)

         data1     data2
key1
a     0.501373  2.926418
b     1.499588  0.339026

# Apply di Dataframe

* Sangat penting juga untuk mengefisienkan Code

In [100]:
def sum_kuadrat(x):
    return x.sum()**2

data = {
  "x": [5, 4, 3],
  "y": [2, 1, 7]
}
df = pd.DataFrame(data)
df

   x  y
0  5  2
1  4  1
2  3  7

In [101]:
df.apply(sum_kuadrat)

x    144
y    100
dtype: int64

<center><h1><strong><font color="blue"> Pivot Tables and Cross-Tabulation </font></strong></h1></center>

A pivot table is a data summarization tool frequently found in spreadsheet programs
and other data analysis software. It aggregates a table of data by one or more keys,
arranging the data in a rectangle with some of the group keys along the rows and
some along the columns. Pivot tables in Python with pandas are made possible
through the groupby

In [102]:
import seaborn as sns

tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [105]:
tips.pivot_table(index=['day', 'smoker'], aggfunc = "max")

             size    tip  total_bill
day  smoker
Thur Yes        4   5.00       43.11
     No         6   6.70       41.19
Fri  Yes        4   4.73       40.17
     No         3   3.50       22.75
Sat  Yes        5  10.00       50.81
     No         4   9.00       48.33
Sun  Yes        5   6.50       45.35
     No         6   6.00       48.17

# CrossTab

* A cross-tabulation (or crosstab for short) is a special case of a pivot table that computes group frequencies.

In [106]:
pd.crosstab(tips.day, tips.smoker)

smoker  Yes  No
day
Thur     17  45
Fri      15   4
Sat      42  45
Sun      19  57

# Kembali ke Case Study: Analisis Data Akademik

In [107]:
try: # Running Locally, yakinkan "file_" berada di folder "data"
    mengajar = pd.read_csv('data/mengajar.csv', encoding='utf8')
    dosen = pd.read_csv('data/tb_dosen.csv', encoding='utf8')
    kelas = pd.read_csv('data/tb_kelas.csv', encoding='utf8')
    krs = pd.read_csv('data/tb_krs.csv', encoding='utf8')
    mahasiswa = pd.read_csv('data/tb_mahasiswa.csv', encoding='utf8')
    matkul = pd.read_csv('data/tb_mata_kuliah.csv', encoding='utf8')
    nilai = pd.read_csv('data/tb_nilai.csv', encoding='utf8')
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_nilai.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/mengajar.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_dosen.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_kelas.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_krs.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_mahasiswa.csv
    !wget -P data/ https://raw.githubusercontent.com/taudataid/eLearning/master/data/tb_mata_kuliah.csv
    mengajar = pd.read_csv('data/mengajar.csv', encoding='utf8')
    dosen = pd.read_csv('data/tb_dosen.csv', encoding='utf8')
    kelas = pd.read_csv('data/tb_kelas.csv', encoding='utf8')
    krs = pd.read_csv('data/tb_krs.csv', encoding='utf8')
    mahasiswa = pd.read_csv('data/tb_mahasiswa.csv', encoding='utf8')
    matkul = pd.read_csv('data/tb_mata_kuliah.csv', encoding='utf8')
    nilai = pd.read_csv('data/tb_nilai.csv', encoding='utf8')

mengajar.shape, dosen.shape, kelas.shape, krs.shape, mahasiswa.shape, matkul.shape, nilai.shape

((14, 4), (4, 6), (4, 4), (7, 6), (15, 8), (9, 3), (33, 7))

In [109]:
dosen.head()

,NIDN,nama,email,Pendidikan_Terakhir,Telephone,Jenis_Kelamin
0,123,Andri Basuki,anbr@googol.com,S3,11230000,Pria
1,234,zulfikar,dosen@email.com,S3,22340000,Pria
2,787,yudi,yudi@email.com,S2,55670000,Pria
3,345,Annisa Fitria,annniza@yyyy.com,S2,88970000,Wanita

![taudata Analytics](https://github.com/taudataid/eLearning/raw/master/images/Schema-case-study-02-Data-wrangling-academics-analytics.jpeg "taudata Analytics")

# Task 01:

## *Apakah ada dosen yang cenderung memberikan nilai cenderung lebih tinggi (atau lebih rendah) dibandingkan dosen lainnya?*

In [112]:
# Code Untuk Task 01

nilai_dosen = nilai.groupby(nilai['NIDN']).mean()[['nilai']]
nilai_dosen = nilai_dosen.rename({'nilai': 'mean_nilai'}, axis=1) 
nilai_dosen = pd.merge(dosen, nilai_dosen, left_on='NIDN', right_index=True)
nilai_dosen = nilai_dosen[['NIDN', 'nama', 'mean_nilai']]
sb = nilai.groupby(nilai['NIDN']).std()[['nilai']]
sb = sb.rename({'nilai': 'std_nilai'}, axis=1) 
nilai_dosen = nilai_dosen.set_index(['NIDN']) 
nilai_dosen = pd.concat([nilai_dosen, sb], axis=1)
nilai_dosen

               nama  mean_nilai  std_nilai
NIDN
123    Andri Basuki   85.750000   7.741355
234        zulfikar   80.428571  15.883504
787            yudi   70.571429  13.010984
345   Annisa Fitria   60.090909  16.220077

# Diskusi 01: 

* Apakah baik menilai (judge) hanya dari rata-rata.
* Rata-rata + Variansi cukup?
* Critical THinking: Hati-hati membandingkan mata pelajarannya yang berbeda, bisa jadi misal suatu mata kuliah memang lebih sulit dari MK lain. Atau MK dasar VS MK di semester akhir.
* Lalu apa yang harus dilakukan untuk melakukan perbandingan yang lebih baik? ==> standarisasi soal, membandingkan MK sama di tempat berbeda (misal MK pelayanan).
* Data Science perlu di barengi dengan business understanding dan terkadang studi kualitatif untuk mendapatkan insight yang baik.

# Task 02:

## *Menurut data yang ada, apakah terdapat perbedaan dalam pemberian nilai antara dosen dengan Pendidikan Terakhir S3 dan S2?*

In [ ]:
# Code Untuk Task 02

# Diskusi 02:

*

# Task 03:

## *Apakah terdapat perbedaan performa akademik antara mahasiswa yang berasal dari Madrasah/SMK dan SMU?*

In [ ]:
# Code Task 03

# Diskusi 03:

*

# Task 04:

## *Apakah ada perbedaan yang nampak di data terhadap kemampuan akademik antara mahasiswa dan mahasiswi?*

In [ ]:
# Code Task 04

# Diskusi 04

*

# Task 05:

## *Apakah ada perbedaan prestasi akademik yang nampak di data antar angkatan mahasiswa?*

In [ ]:
# Code Task 05

# Diskusi 05

*

# Task 06:

## *Apakah ada permasalahan di data atau informasi lain yang anda temukan di data?*

In [ ]:
# Code Task 06

# Diskusi 06

*